[
  {
    "name": "Salvon Ahmed",
    "school": "Juanita",
    "sport": "Football",
    "position": "Defensive back",
    "year": "Junior",
    "blurb": "Wherever he lines up, Ahmed makes opponents account for him, having developed into one of the state’s prized recruits for the class of 2017. A two-way first-team pick in KingCo 3A/2A as a DB and RB, and Offensive Player of the Year, he keyed Juanita of Kirkland’s jaunt to the state quarterfinals for the first time since 1989.",
    "image": "/assets/athletes/SB_026-Ahmed.JPG"
  },
  {
    "name": "Clinton Allen Jr.",
    "school": "Bishop Blanchet",
    "sport": "Football",
    "position": "Wide receiver",
    "year": "Senior",
    "blurb": "On a team filled with playmakers, Allen stood out for his ability to find the end zone after he came up with crucial catches, and the Braves reached the Class 3A semifinals for the first time since 1974. He finished with 63 receptions for 1,171 yards (18.6 per catch) and 24 TDs, including a pair in Friday’s loss to Bellevue.",
    "image": "/assets/athletes/SB_003-Allen.JPG"
  },
  {
    "name": "Kat Anderson",
    "school": "Kamiak",
    "sport": "Volleyball",
    "position": "Setter",
    "year": "Senior",
    "blurb": "Anderson embodies all of the characteristics coaches cherish in terms of leadership, ethics, competitiveness and compassion. And she has a tremendous skill set, as well as a scholarship to Stanford to play beach volleyball. A three-year captain and ASB president as a senior for the Mukilteo school, she had nearly 9.5 assists per set this season while also contributing 39 aces (91 percent serve accuracy), 211 digs, 30 kills and 12 blocks for the district qualifiers.",
    "image": "/assets/athletes/SB_039-Anderson.JPG"
  },
  {
    "name": "Dylan Axelson",
    "school": "Woodinville",
    "sport": "Football",
    "position": "Linebacker",
    "year": "Senior",
    "blurb": "Axelson embodies all of the qualities coach Wayne Maxwell embraces in a player in terms of leadership, intensity and performance. He was named KingCo 4A Defensive MVP after breaking the school record in tackles with 115, and was also a first-team running back for the quarterfinalists.",
    "image": "/assets/athletes/SB_027-Axelson.JPG"
  },
  {
    "name": "Rashaad Boddie",
    "school": "Skyline",
    "sport": "Football",
    "position": "Running back",
    "year": "Senior",
    "blurb": "Opposing coaches considered the All-KingCo back the player they had to game-plan around, and he’s a key reason Skyline of Sammamish is back in the Class 4A championship game after a two-year hiatus. The Colorado State recruit has rushed for more than 1,700 yards with 19 TDs and is also a receiving threat out of the backfield.",
    "image": "/assets/athletes/SB_008-Boddie.JPG"
  },
  {
    "name": "Bob Bourgette",
    "school": "Kennedy Catholic",
    "sport": "Football",
    "position": "Coach",
    "blurb": "\"Coach B\" has been a fixture at Kennedy Catholic of Burien since 1972, when he joined the football staff as an assistant coach. He later took over as head coach and compiled an impressive 201-40 record in 21 seasons. This year’s squad went 9-0 before running into powerful Bellevue in the Class 3A state playoffs.",
    "image": "/assets/athletes/SB_015-Bourgette.JPG"
  },
  {
    "name": "Asia Brisco",
    "school": "Renton",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Senior",
    "blurb": "As a senior, the Washington recruit had 26 goals and 11 assists, one year after helping Renton qualify for the state playoffs for the first time in school history in 2014. Brisco was named Seamount League girls soccer Athlete of the Year for the second season in a row and was All-Seamount first-team all four years. Brisco finished her career with 99 goals and 27 assists, including 55 goals and 19 assists combined the last two seasons.",
    "image": "/assets/athletes/SB_031-Brisco.JPG"
  },
  {
    "name": "Jen Chartrand",
    "school": "Shorewood",
    "sport": "Volleyball",
    "position": "Coach",
    "blurb": "In her five seasons as head coach, Chartrand has developed Shorewood into an annual WesCo 3A contender. The Thunderbirds from Shoreline won the league championship for the second year in a row and added the district title this year to advance to state, where they reached the semifinals for the first time since 1978. Shorewood ultimately took home the fourth-place trophy this year in a talented field to finish an impressive 25-3 overall.",
    "image": "/assets/athletes/SB_046-Chartrand.JPG"
  },
  {
    "name": "Peyton Chick",
    "school": "Kentridge",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Senior",
    "blurb": "Chick stretched opposing defenses for the Chargers and finished with 17 goals and four assists this season. The Western Washington recruit finished her career with 53 goals and eight assists as Kentridge went 52-11-8 during her four years. The Chargers won their third consecutive SPSL 4A Northeast title this season, going 12-1-0 and reached the state playoffs for the fifth season in a row. They finished 14-3-0.",
    "image": "/assets/athletes/SB_036-Chick.JPG"
  },
  {
    "name": "Duke Clinch",
    "school": "Woodinville",
    "sport": "Football",
    "position": "Offensive lineman",
    "year": "Senior",
    "blurb": "Clinch was crucial to the Falcons’ success this season as they advanced to the state quarterfinals for only the second time since 2006. He was a force on offense with smothering blocks, earning All-KingCo 4A first-team honors, but also was disruptive defensively.",
    "image": "/assets/athletes/SB_010-Clinch.JPG"
  },
  {
    "name": "Mia Corbin",
    "school": "Tahoma",
    "sport": "Soccer",
    "position": "Midfielder",
    "year": "Senior",
    "blurb": "The Bears’ leader propelled her team within a game of a Class 4A state berth and to a second-place finish in the SPSL 4A Northeast Division. Corbin put up 11 goals and 12 assists for the school from Maple Valley and earned a scholarship to California. She was named SPSL 4A North co-MVP this fall while carrying a 3.97 grade-point average.",
    "image": "/assets/athletes/SB_032-Corbin.JPG"
  },
  {
    "name": "Jack Crane",
    "school": "Skyline",
    "sport": "Football",
    "position": "Kicker",
    "year": "Senior",
    "blurb": "Crane is enjoying one of the best seasons for a kicker in state history as the surprising Spartans have crashed into the Class 4A championship game. His field goal Saturday gave him 16 this season — second in state history — and he regularly boots kickoffs into the end zone, helping Skyline win the field-position game.",
    "image": "/assets/athletes/SB_013-Crane.JPG"
  },
  {
    "name": "Emmanuel Daigbe",
    "school": "Kent-Meridian",
    "sport": "Football",
    "position": "Wide receiver",
    "year": "Senior",
    "blurb": "Athletic and strong (defending state wrestling champion at 182 pounds), Daigbe has the ability to go up and catch the football in a crowd. He had 54 receptions for 1,098 yards with 10 TDs this year, giving him 94 career catches, 1,815 yards and 20 TDs. Twice named All-SPSL Northeast All-Purpose Player of the Year.",
    "image": "/assets/athletes/SB_009-Daigbe.JPG"
  },
  {
    "name": "Marquis Deweert",
    "school": "Bellevue",
    "sport": "Football",
    "position": "Offensive lineman",
    "year": "Senior",
    "blurb": "No. 55 was all over the field in Bellevue’s semifinal victory over Bishop Blanchet, showcasing his skills on both sides of the football. Deweert, the Offensive Lineman of the Year in KingCo 3A/2A and a first-team choice on defense as well, helped the Wolverines rush for more than than 250 yards per game.",
    "image": "/assets/athletes/SB_002-Deweert.JPG"
  },
  {
    "name": "Jack Dinneen",
    "school": "Ballard",
    "sport": "Football",
    "position": "Punter",
    "year": "Senior",
    "blurb": "Dinneen dazzled over the summer as he won a pair of national kicking combines, earning All-America honors, and stood out as the Metro League’s top punter and kicker. He averaged better than 35 yards on more than 30 punts, often pinning opponents inside their own 20, helping Ballard reach the Class 3A playoffs.",
    "image": "/assets/athletes/SB_020-Dinneen.JPG"
  },
  {
    "name": "Samantha Drechsel",
    "school": "Cedar Park Christian",
    "sport": "Volleyball",
    "position": "Outside hitter",
    "year": "Junior",
    "blurb": "At 6 feet 3, Drechsel is an intimidating presence at the net for the Eagles from Bothell and a key reason they have placed at state the past three seasons — including the second-place plaque this fall. The daughter of coach Marni Drechsel and co-MVP in the Cascade Conference, she amassed 504 kills (including 105 in four state matches this year), 247 digs, 51 aces and 29 blocks. The Maryland recruit also sets when needed.",
    "image": "/assets/athletes/SB_041-Drechsel.JPG"
  },
  {
    "name": "Angelou Dunton",
    "school": "Holy Names",
    "sport": "Volleyball",
    "position": "Outside hitter",
    "year": "Senior",
    "blurb": "Dunton developed into one of the area’s top hitters through hard work and determination, showing surprising hops for a player not quite 5 feet 7, and is a key reason the Cougars reached the Class 3A state tournament the past three years. She had nearly 16 kills per match this season and earned all-tourney honors for the second time. The two-time Star Times pick is headed to the Coast Guard Academy.",
    "image": "/assets/athletes/SB_044-Dunton.JPG"
  },
  {
    "name": "Mina Duong",
    "school": "Monroe",
    "sport": "Volleyball",
    "position": "Libero",
    "year": "Junior",
    "blurb": "Duong’s defense stood out all season and was a major factor in Monroe’s return to the Class 4A state tournament after a two-year absence. She established a school record for digs with 353, which was nearly 5.5 per set, as the Bearcats went through the regular season unbeaten outside of tournament play. Duong, already a three-year veteran, was also a deadly server who notched 51 aces this season (0.8 per set).",
    "image": "/assets/athletes/SB_040-Duong.JPG"
  },
  {
    "name": "Omar Dyles",
    "school": "Bellevue",
    "sport": "Football",
    "position": "Defensive lineman",
    "year": "Senior",
    "blurb": "A third-year starter, Dyles stood out as the Defensive Lineman of the Year in KingCo 3A/2A and has been instrumental in the Wolverines’ run to 3A title game for the eighth year in a row. Lightning quick off the ball with a high motor, he is disruptive in the backfield and also plays downfield in pursuit.",
    "image": "/assets/athletes/SB_016-Dyles.JPG"
  },
  {
    "name": "Jacob Eason",
    "school": "Lake Stevens",
    "sport": "Football",
    "position": "Quarterback",
    "year": "Senior",
    "blurb": "The Georgia recruit, considered one of the top prep quarterbacks in the country, lived up to expectations in leading the Vikings to the Class 4A semifinals for only the second time since 1994. He completed 68 percent of his passes en route to 3,559 yards and 45 TDs. Eason fell just shy of 10,000 career yards and had 102 TDs.",
    "image": "/assets/athletes/SB_004-Eason.JPG"
  },
  {
    "name": "Apryll Eneliko",
    "school": "Kennedy Catholic",
    "sport": "Volleyball",
    "position": "Outside hitter",
    "year": "Senior",
    "blurb": "Eneliko is one of the hardest hitters around, and knew how to elevate her game when the Lancers needed her most — especially during their run to the first Class 3A state championship in school history. In Kennedy’s final two matches, she put together 50 kills and nine blocks to become a clear all-tournament choice. Eneliko is a two-time All-Seamount selection who was voted team MVP as a junior. Her sister, Ashley, was a Star Times player in 2008.",
    "image": "/assets/athletes/SB_045-Eneliko.JPG"
  },
  {
    "name": "Isaac Garcia",
    "school": "Bellevue",
    "sport": "Football",
    "position": "Defensive lineman",
    "year": "Senior",
    "blurb": "Garcia has been part of Bellevue’s dominant defensive front the past three seasons and is a key to this year’s continued success. At 6 feet 4 and 220 pounds, the Oregon State recruit is long and athletic, recording seven sacks in eight regular-season games. He’s also a two-year starter at tight end and contributes on offense.",
    "image": "/assets/athletes/SB_014-Garcia.JPG"
  },
  {
    "name": "Andrew Grimes",
    "school": "Lake Stevens",
    "sport": "Football",
    "position": "Running back",
    "year": "Senior",
    "blurb": "Despite nagging injuries, Grimes gained nearly 10 yards per carry in amassing more than 1,600 yards for the second season in a row, including 157 in the semifinal loss to Skyline. A hard, downhill runner, he logged his 28th rushing TD Saturday to give him 51 the past two years. He made the Vikings two-dimensional.",
    "image": "/assets/athletes/SB_005-Grimes.JPG"
  },
  {
    "name": "Justin Guffey",
    "school": "Glacier Peak",
    "sport": "Football",
    "position": "Defensive back",
    "year": "Senior",
    "blurb": "Guffey was a difference-maker on both sides of the football as the Grizzlies reached the Class 3A state quarterfinals for only the second time in school history. A three-year starter and All-WesCo choice each way, he is fourth all-time for the Snohomish school in tackles (164) and receiving yards (1,540).",
    "image": "/assets/athletes/SB_018-Guffey.JPG"
  },
  {
    "name": "Anfernee Gurley",
    "school": "Archbishop Murphy",
    "sport": "Football",
    "position": "Defensive back",
    "year": "Junior",
    "blurb": "Gurley was the go-to guy for the Wildcats from Everett and the Cascade Conference Player of the Year as they returned to the Class 2A semifinals for the first time since 2011 and finished 12-1. He did a little bit of everything on offense with nearly 1,400 combined rushing and receiving yards with 19 TDs, and was a stalwart on defense.",
    "image": "/assets/athletes/SB_019-Gurley.JPG"
  },
  {
    "name": "Andy Hendricks",
    "school": "Seattle Prep",
    "sport": "Soccer",
    "position": "Coach",
    "blurb": "Seattle Prep has set the standard in Metro League girls soccer, and Hendricks has been a big reason why. The longtime Panthers coach this fall guided his team to the school’s third state title and a school-best 22-0-1 record. Hendricks, whose teams have also earned 3A state championships in 2010 and 2011 and played in seven state finals, owns a career record of 366-97-70 mark in 26 seasons.",
    "image": "/assets/athletes/SB_047-Hendricks.JPG"
  },
  {
    "name": "Samantha Hiatt",
    "school": "Seattle Prep",
    "sport": "Soccer",
    "position": "Defender",
    "year": "Senior",
    "blurb": "Hiatt could have filled almost any role with the Class 3A state champions, but her best position is defender. The Boston College recruit delivered many key stops and free-kick precision. Hiatt had four goals and one assist in her stopper role this season and finished with 17 career goals and 18 assists. She earned All-Metro’s first-team honors all four years.",
    "image": "/assets/athletes/SB_033-Hiatt.JPG"
  },
  {
    "name": "Bryce Hoisington",
    "school": "Vashon Island",
    "sport": "Football",
    "position": "Running back",
    "year": "Junior",
    "blurb": "Hoisington ran into the state record books with a monster season. He piled up 2,929 yards, surpassing the 11-man mark of 2,877 set in 2014, and did it in just 10 games. It took another state record to get there as he rushed for 573 yards in the final game. Hoisington gained 8.7 yards per carry and scored 32 TDs.",
    "image": "/assets/athletes/SB_012-Hoisington.JPG"
  },
  {
    "name": "Iziq Ifopo",
    "school": "Kennedy Catholic",
    "sport": "Football",
    "position": "Offensive lineman",
    "year": "Senior",
    "blurb": "At 6 feet 1 and 300 pounds, Ifopo has surprising quickness and explodes off the line. He was a big reason the Lancers averaged better than 300 yards rushing in a 9-1 season that ended with a playoff loss to Bellevue. Named the Seamount’s Lineman of the Year on offense and defense as well as Athlete of the Year.",
    "image": "/assets/athletes/SB_011-Ifopo.JPG"
  },
  {
    "name": "Abi Kim",
    "school": "Seattle Christian",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Senior",
    "blurb": "The speedster put opposing defenses on their heels all season and was a big reason the Warriors secured the school’s ninth Class 1A state title by beating Cascade of Leavenworth, 3-0. Kim finished with 41 goals and five assists. The California soccer recruit may also compete in track. Kim owns school records and state titles at the 100 and 200 meters, and also set a school mark and was second at state in the long jump.",
    "image": "/assets/athletes/SB_034-Kim.JPG"
  },
  {
    "name": "Harley Kirsch",
    "school": "Eastside Catholic",
    "sport": "Football",
    "position": "Athlete",
    "year": "Senior",
    "blurb": "Kirsch won his 38th game as a starter Friday as the nationally ranked Crusaders from Sammamish reached the Class 3A title game for the third-straight year. His four TD passes against Lakes gave him 34 this season against just two interceptions. The Cornell recruit has surpassed 10,000 passing and 100 TDs in his career.",
    "image": "/assets/athletes/SB_006-Kirsch.JPG"
  },
  {
    "name": "Justin Madden",
    "school": "Jefferson",
    "sport": "Football",
    "position": "Linebacker",
    "year": "Senior",
    "blurb": "An instinctive player with a nose for the football, Madden made life miserable for most opponents in the SPSL 4A Northwest Division as the Raiders won an outright league title for only the second time in school history. He was voted Defensive Player of the Year and notched better than 10 tackles per game.",
    "image": "/assets/athletes/SB_028-Madden.JPG"
  },
  {
    "name": "Shayne McPherson",
    "school": "Kennedy Catholic",
    "sport": "Volleyball",
    "position": "Outside hitter",
    "year": "Senior",
    "blurb": "After missing the last half of the 2014 season with an injury, McPherson fired on all cylinders this year in leading the Lancers from Burien to their first-ever Class 3A state volleyball title, showing why she is going on to play beach and indoor volleyball at Washington. The two-time Seamount MVP is a fierce competitor who thrives under pressure. In four state matches, McPherson had 85 kills, 48 digs, 17 aces and five blocks to earn MVP honors.",
    "image": "/assets/athletes/SB_042-McPherson.JPG"
  },
  {
    "name": "Anna Miller",
    "school": "Issaquah",
    "sport": "Soccer",
    "position": "Goalkeeper",
    "year": "Senior",
    "blurb": "Miller posted 11 shutouts and gave up just eight goals for the Class 4A state champs — a 0.42 goals-against average. The Concordia of Portland, Oregon, recruit had a knack for late saves, but her biggest moment came in the Class 4A semifinals. She had two huge penalty-kick shootout saves that sealed the Eagles’ 1-0 overtime victory over Camas.",
    "image": "/assets/athletes/SB_035-Miller.JPG"
  },
  {
    "name": "Michael Nelson",
    "school": "Lake Stevens",
    "sport": "Football",
    "position": "Offensive lineman",
    "year": "Senior",
    "blurb": "The Vikings averaged more than 530 yards of total offense in recording a 12-win season, and Nelson was a key factor. They ran behind him when they needed key yards and he was sensational in pass protection. Coach Tom Tri called Nelson “a beast” on both sides of the football as he earned All-WesCo honors both ways.",
    "image": "/assets/athletes/SB_007-Nelson.JPG"
  },
  {
    "name": "Kaylene Pang",
    "school": "Issaquah",
    "sport": "Soccer",
    "position": "Defender",
    "year": "Junior",
    "blurb": "The Washington recruit was tireless in leading the Class 4A state champions’ back line, and also had one goal and six assists. She earned KingCo 4A Defensive MVP and all-state the past two seasons. Issaquah outscored opponents 63-14 during the 2015 season. Coach Tom Bunnell calls her “the best one-on-one defender I have ever coached.”",
    "image": "/assets/athletes/SB_038-Pang.JPG"
  },
  {
    "name": "Doug Russell",
    "school": "O'Dea",
    "sport": "Football",
    "position": "Defensive lineman",
    "year": "Junior",
    "blurb": "In a program known for a rich tradition of turning out Division I football talent, Russell is regarded as the next big thing. Coach Monte Kohler said he “has a chance to be great” with size (6 feet 3, 270) and mobility. Named the Lineman of the Year in the Metro Mountain Division.",
    "image": "/assets/athletes/SB_017-Russell.JPG"
  },
  {
    "name": "Connor Smith",
    "school": "Issaquah",
    "sport": "Football",
    "position": "Defensive lineman",
    "year": "Senior",
    "blurb": "Smith stood out as the Lineman of the Year in KingCo 4A, which featured a number of top-notch prospects up front. The three-year starter was a first-team selection this season on offense and defense, helping the Eagles soar into the state playoffs, where they ran into top-ranked Lake Stevens.",
    "image": "/assets/athletes/SB_025-Smith.JPG"
  },
  {
    "name": "Tivona Tinsley",
    "school": "Beamer",
    "sport": "Soccer",
    "position": "Defender",
    "year": "Senior",
    "blurb": "Tinsley helped the Titans from Federal Way win the SPSL 4A Northeast title, finish 16-3-0 overall and reach the state playoffs. Beamer’s centerback, who focused on foes’ top attacking threat, was a big reason her team posted 11 shutouts this fall and limited opponents to 12 goals in 19 matches. She was All-SPSL North first team the past three seasons, and notched three goals and three assists this fall.",
    "image": "/assets/athletes/SB_030-Tinsley.JPG"
  },
  {
    "name": "Olivia Van der Jagt",
    "school": "Kentridge",
    "sport": "Soccer",
    "position": "Midfielder",
    "year": "Junior",
    "blurb": "Van der Jagt’s numbers — 11 goals and eight assists — don’t begin to measure her value to the Chargers. The Washington recruit, who was named SPSL 4A North’s co-MVP, could have scored more as a forward but was positioned a lot as a defensive midfielder. In three varsity seasons, the junior has 27 goals and 18 assists. And she still has one more season to play.",
    "image": "/assets/athletes/SB_037-VanDerJagt.JPG"
  },
  {
    "name": "Sophia Viviano",
    "school": "Shorecrest",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Senior",
    "blurb": "The Scots forward had 23 goals and nine assists in helping her team finish 17-3-1 and reach the Class 2A state quarterfinals. The Gonzaga recruit pushed the Shoreline school to a state runner-up finish in 2014, and piled up 66 goals and 20 assists in her four-year career, including a combined 54 goals and 14 assists over the last two seasons.",
    "image": "/assets/athletes/SB_029-Viviano.JPG"
  },
  {
    "name": "Josh Watson",
    "school": "Cascade",
    "sport": "Football",
    "position": "Offensive lineman",
    "year": "Senior",
    "blurb": "The four-year letterman developed into one of the state’s top linemen and dominated at times with his 6-foot-5, 265-pound frame. Watson earned All-WesCo accolades on both sides of the football for the Bruins from Everett and weighed several Division I offers before committing to Washington State.",
    "image": "/assets/athletes/SB_001-Watson.JPG"
  },
  {
    "name": "Jonathon Webster",
    "school": "Eastside Catholic",
    "sport": "Football",
    "position": "Defensive back",
    "year": "Senior",
    "blurb": "The Crusaders, defending 3A champions, feature a ton of talent and flashy players, but none has been more consistent or reliable defensively than Webster. The three-year starter is known for making big plays — like the two end-zone picks in last year’s quarterfinals against Lincoln. He had a game-high nine tackles in Friday’s semifinals.",
    "image": "/assets/athletes/SB_021-Webster.JPG"
  },
  {
    "name": "Brandon Wellington",
    "school": "Eastside Catholic",
    "sport": "Football",
    "position": "Linebacker",
    "year": "Senior",
    "blurb": "One of the most athletic players in the state, Wellington’s talents were on full display in Friday’s 3A semifinal victory on a pair of 80-plus-yard kickoff returns for scores as well as a TD catch. The UW recruit is a big hitter on defense (with five picks) for the Sammamish school, earning co-MVP honors in the Metro Mountain Division.",
    "image": "/assets/athletes/SB_022-Wellington.JPG"
  },
  {
    "name": "Amandré Williams",
    "school": "Tahoma",
    "sport": "Football",
    "position": "All-purpose",
    "year": "Senior",
    "blurb": "Williams did a little bit of most everything in leading the Bears from Maple Valley to the Class 4A playoffs as a quarterback, defensive end and punter. The UW recruit, a three-year starter, led the SPSL 4A Northeast in passing (earning Offensive Back of the Year) and was a first-team choice on defense.",
    "image": "/assets/athletes/SB_023-Williams.JPG"
  },
  {
    "name": "Jalen Woodward",
    "school": "Seattle Prep",
    "sport": "Soccer",
    "position": "Midfielder",
    "year": "Senior",
    "blurb": "The USC recruit was the team leader who guided Seattle Prep to its best season mark in school history (22-0-1) and the program’s third Class 3A state title. Woodward finished with 12 goals and 12 assists. Woodward was 65-10-13 over four seasons, and supplied 38 goals and 26 assists during her varsity career. She was named All-Metro League first team all four seasons for Prep and was Metro Sound co-MVP this fall.",
    "image": "/assets/athletes/SB_024-Woodward.JPG"
  },
  {
    "name": "Jemma Yeadon",
    "school": "Mercer Island",
    "sport": "Volleyball",
    "position": "Outside hitter",
    "year": "Senior",
    "blurb": "The high-flying Yeadon amassed more than 1,200 kills and 1,000 digs as a four-year starter for the Islanders, who won the 3A state title her sophomore year and were expected to contend for this year’s crown before she suffered a late bone bruise that sidelined her. The clear MVP in KingCo 3A/2A, four-time first-team choice and returning Star Times selection, Yeadon hit .437 this year while delivering 396 kills, 213 digs, 56 aces and 28 blocks. Signed with Notre Dame.",
    "image": "/assets/athletes/SB_043-Yeadon.JPG"
  }
]