[
  {
    "name": "Isiah Brown",
    "school": "Lakeside",
    "position": "Guard",
    "height": "6-3",
    "year": "Senior",
    "blurb": "The Northwestern-bound shooter became the Metro League's all-time leading scorer with with 2,380 points this season. He average a state-best 33.9 points a game and was the Metro MVP.",
    "image": "/assets/athletes/20160229startimes_brown.JPG"
  },
  {
    "name": "Jadyn Bush",
    "school": "Bishop Blanchet",
    "position": "Post/wing",
    "height": "5-11",
    "year": "Junior",
    "blurb": "Bush, who led the Braves to top-three finishes at state her first two seasons, is described as relentless, fearless and competitive. She is an outstanding defender as well as an offensive force, this year averaging 18.4 points, 9.2 rebounds and 2.7 steals as Blanchet reached the regional round and finished 23-3.",
    "image": "/assets/athletes/20160229startimes_bush.JPG"
  },
  {
    "name": "Taya Corosdale",
    "school": "Bothell",
    "position": "Wing/post",
    "height": "6-2",
    "year": "Junior",
    "blurb": "The KingCo 4A MVP has been the key to the Cougars' success this year as they return to the state quarterfinals at 23-1. She has led her team in scoring and rebounding in each of her three seasons, and this year averages 18.5 points, 11.3 rebounds, 2.7 blocks, 2.3 steals and 2.0 assists. She has multiple Division I offers.",
    "image": "/assets/athletes/20160229startimes_corosdale.JPG"
  },
  {
    "name": "Sam Cunliffe",
    "school": "Rainier Beach",
    "position": "Forward",
    "height": "6-6",
    "year": "Senior",
    "blurb": "Smooth and fluid on the floor, the Arizona State-bound forward can score from anywhere and create his own shot. He has the short to mid-range jumper that goes with the long-range, 3-point shooting, and can also go to the rim. He averaged 21.6 points, 9 rebounds and 3 assists for the Tacoma Dome-bound Vikings.",
    "image": "/assets/athletes/20160229startimes_cunliffe.JPG"
  },
  {
    "name": "Lydia Giomi",
    "school": "West Seattle",
    "position": "Center",
    "height": "6-7",
    "year": "Senior",
    "blurb": "A two-time Metro MVP, Giomi was also named the league's defensive player of the year. She topped the 1,000 mark in career points and rebounds this season and regularly posted double-doubles, finishing at 15.2 points and 12.8 rebounds as the Wildcats &mdash; a best-ever sixth at 3A state last season &mdash; finished 22-4 this year. She has signed with Oregon.",
    "image": "/assets/athletes/20160229startimes_giomi.JPG"
  },
  {
    "name": "Mikey Henn",
    "school": "Bellevue",
    "position": "Post",
    "height": "6-7",
    "year": "Senior",
    "blurb": "About to do about anything, the Cal State-Davis signee and KingCo 3A/2A MVP averaged 20.5 points, 9 rebounds and 3 assists for a Wolverines team that had lost just once &mdash; to No. 1 Garfield &mdash; in the state of Washington this season heading into the regional round of the playoffs.",
    "image": "/assets/athletes/20160229startimes_henn.JPG"
  },
  {
    "name": "Jalen McDaniels",
    "school": "Federal Way",
    "position": "Post",
    "height": "6-9",
    "year": "Senior",
    "blurb": "The San Diego State-bound post proved how versatile he is this season. He can plan on the block or handle the ball from the point when asked. He averaged 17.5 points and 7.7 rebounds a game, and was named the SPSL Northwest MVP.",
    "image": "/assets/athletes/20160229startimes_mcdaniels.JPG"
  },
  {
    "name": "Tony Miller",
    "school": "Woodinville",
    "position": "Forward",
    "height": "6-6",
    "year": "Senior",
    "blurb": "A second-generation Star Times athete (mom Karin made the girls' team in 1978), the KingCo 4A MVP averaged 28.6 points and 12.5 rebounds a game as a senior, leading the Falcons to the state regional round.",
    "image": "/assets/athletes/20160229startimes_miller.JPG"
  },
  {
    "name": "Mikayla Pivec",
    "school": "Lynnwood",
    "position": "Wing/guard",
    "height": "5-10",
    "year": "Senior",
    "blurb": "Pivec's career includes 1,700-plus points, nearly 1,400 rebounds and 96 victories with two state trophies. She was tournament MVP as the Royals won last year's 3A title. They are 24.0 this season with Pivec averaging 22 points, 14 rebounds, 4.5 steals and 4.0 assists. The Oregon State signee also excels in cross country and track.",
    "image": "/assets/athletes/20160229startimes_pivec.JPG"
  },
  {
    "name": "Anna Wilson",
    "school": "Bellevue",
    "position": "Guard",
    "height": "5-8",
    "year": "Senior",
    "blurb": "Wilson, who has signed with Stanford, moved from Virginia last year in part to be closer to her brother, Seahawks quarterback Russell Wilson. The KingCo 3A/2A MVP leads the top-ranked Wolverines in scoring (15.9 average) and also averages 4.8 assists, 4.2 rebounds and 3.5 steals. She was chosen to play in the McDonald's All-American game.",
    "image": "/assets/athletes/20160229startimes_wilson.JPG"
  },
  {
    "name": "Joe Marsh",
    "school": "Arlington",
    "position": "Coach",
    "blurb": "Marsh, in his fifth year as head girls' coach after eight seasons as an assistant in the boys' program, has the third-ranked Eagles (23-1) back in the 3A state quarterfinals after a fourth-place finish last year. Arlington placed second in the 4A tourname in 2013. Marsh has a five-year record of 103-26.",
    "image": "/assets/athletes/20160229startimes_marsh.JPG"
  },
  {
    "name": "Jerry Petty",
    "school": "Cleveland",
    "position": "Coach",
    "blurb": "The Eagles hadn't had a winning season since the 2007-08 campaign, when they were 15.8. They hadn't won more than eight games in the five years prior to his arrival. Petty, in his second year, went 21-6 and got his team into the state 3A regional round a year after going 9-11.",
    "image": "/assets/athletes/20160229startimes_petty.JPG"
  }
]